Repository: edutec/s4aWeb
Catalog: devdocs/s4aWeb-translation-CA/s4aWeb-translation-CA-level2.tmx
Source language: en_us
Languages: ca

source: Some of the videos have English subtitles as well.
ca: Alguns d'aquests vídeos també han estat subtitulats a l'anglès.

source: In 2009, Bernat graduated as a technical engineer in Computer Science at the Open University of Catalonia (UOC).
ca: L'any 2009, en Bernat es va graduar com a Enginyer Tècnic en Informàtica de Gestió per la Universitat Oberta de Catalunya (UOC).

source: For any questions and answers, please use the community support mail list.
ca: Per formular preguntes i respostes, si us plau utilitzeu la llista de correu de la comunitat.

source: Workshop
ca: Taller

source: Downloads
ca: Descàrregues

source: Language is now detected upon first launch (when Scratch.ini file doesn't exist).
ca: L'idioma es detecta automàticament en arrencar per primer cop (quan l'arxiu Scratch.ini no existeix).

source: Here you'll find basic S4A examples, complete with the Arduino schematics and an .sb Scratch project file for you to download.
ca: Aquí trobareu exemples bàsics d'S4A, amb els esquemes d'Arduino i un arxiu .sb amb el projecte Scratch per a descarregar.

source: Since then, he's been involved in several programming projects in Citilab, including a social knowledge management system and different educational applications.
ca: Des d'aleshores, ha estat involucrat en diversos projectes de programació al Citilab. Entre d'altres, un sistema de gestió del coneixement i diverses aplicacions educatives.

source: Videos
ca: Vídeos

source: During his time at the company, he worked on programming a wide variety of applications.
ca: Durant el temps que va treballar en aquesta empresa, va programar una àmplia varietat d'aplicacions.

source: http://[IP]:42001/sensor-update=[sensor-name]=[value]
ca: http://[IP]:42001/sensor-update=[nom-del-sensor]=[valor]

source: To access it, just shift + left click on the S4A "File" menu and select "Exit User Mode".
ca: Per accedir-hi, pitjeu majúscules + clic esquerre sobre el menú "Arxiu" d'S4A, i seleccioneu "Sortir del mode d'usuari".

source: There is also a sensors report board similar to the PicoBoard one.
ca: També compta amb un panell de sensors similar al de la PicoBoard.

source: A simple example showing how to trigger an LED by pushing a button.
ca: Un exemple simple mostrant com activar un LED mitjançant un polsador.

source: The main aim of the project is attracting people to the programming world.
ca: La finalitat principal del projecte és atreure gent al món de la programació.

source: Version 1.3
ca: Versió 1.3

source: Version 1.4
ca: Versió 1.4

source: Installing S4A into your computer
ca: Instal·lar S4A a l'ordinador

source: Send the value of a remote sensor (for instance, the client's accelerometer, mouse position, etc):
ca: Enviar el valor d'un sensor remot (per exemple, l'acceleròmetre del client, la posició del punter del ratolí, etc):

source: The goal is also to provide a high level interface to Arduino programmers with functionalities such as interacting with a set of boards through user events.
ca: Un altre objectiu és proporcionar una interfície d'alt nivell per a programadors d'Arduino amb funcionalitats tals com la interacció amb un conjunt de plaques mitjançant esdeveniments d'usuari.

source: Team
ca: Equip

source: Improved Catalan and Spanish translations
ca: Traduccions al català i castellà millorades

source: Added compatibility for Android apps (HiS4A)
ca: Afegida compatibilitat per a aplicacions Android (HiS4A)

source: S4A allows for 6 analog inputs (analog pins), 2 digital inputs (digital pins 2 and 3), 3 analog outputs (digital pins 5, 6 and 9), 3 digital outputs (pins 10, 11 and 13) and 4 special outputs to connect Parallax continuous rotation servomotors (digital pins 4, 7, 8 and 12).
ca: S4A habilita 6 entrades analògiques (pins analògics), 2 entrades digitals (pins digitals 2 i 3), 3 sortides analògiques (pins digitals 5, 6 i 9), 3 sortides digitals (pins 10, 11 i 13) i 4 sortides especials per a connectar servomotors de rotació contínua Parallax (pins digitals 4, 7, 8 i 12).

source: Message Specification
ca: Especificació dels missatges

source: Víctor chose to study Computer Science in the Autonomous University of Barcelona (UAB), but after two years he switched to the Castelldefels School of Technology (EPSC) to course the technical degree on telecommunications.
ca: En Víctor va començar a estudiar Enginyeria en Informàtica a la Universitat Autònoma de Barcelona (UAB), però després de dos anys va passar a estudiar el grau de telecomunicacions a l'Escola Politècnica Superior de Castelldefels.

source: Version 1.5
ca: Versió 1.5

source: A zip file with complete materials and exercices for a workshop can be downloaded here:
ca: Des d'aquí podeu descarregar-vos un zip amb materials i exercicis complets per a realitzar un taller:

source: In S4A, an Arduino board is represented by a special kind of sprite.
ca: En S4A, una placa Arduino es representa amb un tipus especial d'sprite.

source: The data exchange follows the PicoBoard protocol and needs a specific program (firmware) to be installed in the board.
ca: L'intercanvi de dades segueix el protocol PicoBoard, i necessita que s'instal·li un programa específic (firmware) a la placa.

source: Here you'll find all the documentation, videos, examples and exercices we have created.
ca: Aquí trobareu tota la documentació, vídeos, exemples i exercicis que hem produït fins ara.

source: These materials were created and used by our team in an actual S4A course at the Elisava School of Design (Barcelona) in 2011.
ca: El nostre equip va crear i utilitzar aquests materials en un curs d'S4A a l'escola Elisava l'any 2011.

source: At Citilab, he discovered Scratch and Smalltalk, taking up part of his programming work again.
ca: Al Citilab, va descobrir Scratch i Smalltalk, reemprenent part de la seva feina com a programador.

source: Code
ca: Codi

source: Child's Play!
ca: Un joc de nens!

source: Take in account Arduino One requires at least version 0022.
ca: Tingueu en compte que, per a treballar amb Arduino One, us caldrà la versió 0022 o superior.

source: Download and Install
ca: Descàrrega i instal·lació

source: Installing the Firmware into your Arduino
ca: Instal·lar el firmware a Arduino

source: Compatibility
ca: Compatibilitat

source: S4A works on the three major consumer operating systems: Microsoft Windows, GNU/Linux and MacOS.
ca: S4A funciona sobre els tres sistemes operatius d'escriptori més populars: Microsoft Windows, GNU/Linux and MacOS.

source: He is a member of the board of the European Smalltalk Users Group (ESUG) and he leads the Smalltalk.cat local group.
ca: És membre de la mesa de la European Smalltalk Users Group (ESUG) i president de l'associació Smalltalk.cat.

source: You're now in front of a classic Squeak 2.8 image, and have access to a Browser, Workspace and all tools you're used to.
ca: Us trobareu davant de l'entorn clàssic d'una imatge d'Squeak 2.8, i tindreu accés a un Browser, Workspace i totes les eines a què esteu acostumats.

source: Arduteka Blog: S4A
ca: Blog Arduteka: S4A

source: S4A Workshop Introduction
ca: Introducció al taller d'S4A

source: You can reach us at scratch@citilab.eu to report bugs or for any suggestions you may have.
ca: Pots contactar amb nosaltres a scratch@citilab.eu per informar-nos de bugs o per a qualsevol suggerència.

source: Please refer to the Downloads section for further instructions on how to do so.
ca: Si us plau, consulteu la secció de Descàrregues per a més instruccions sobre l'instal·lació.

source: Button and LED
ca: Polsador i LED

source: S4A allows you to control as many boards as USB ports you have.
ca: S4A permet controlar tantes plaques com ports USB tingui el vostre PC.

source: Mail List Web Site
ca: Pàgina web de la llista de correu

source: Using the input of a photoresistor sensor to trigger an LED.
ca: Com utilitzar l'entrada d'un fotoresistor per a activar un LED.

source: The need to analyze the generated information and collected data drove his approach to computing.
ca: La necessitat d'analitzar l'informació generada i les dades recollides va instigar el seu apropament a l'informàtica.

source: Scratch was developed in Squeak Smalltalk by the MIT.
ca: Scratch es va desenvolupar en Squeak Smalltalk per l'Institut Tecnològic de Massachussets (MIT).

source: Serial port where a board is connected opens correctly when S4A is launched
ca: El port sèrie on es connecta una placa s'obre correctament en arrencar S4A

source: Here you'll find the detailed steps to get it up and running.
ca: Aquí trobareu els passos detallats per a posar S4A en marxa.

source: Added reset actuators block
ca: Afegit bloc de reiniciar actuadors

source: In the Tools menu, select the board version and the serial port where the board is connected
ca: Al menú Tools, seleccioneu la versió de la placa i el port sèrie en què heu connectat la placa

source: It was developed in 2010 by the Citilab Smalltalk Team and it has been used since by many people in a lot of differents projects around the world.
ca: El seu desenvolupament el va a dur a terme l'equip d'Smalltalk del Citilab l'any 2010, i des d'aleshores s'ha utilitzat a tot el món per a una gran varietat de projectes.

source: S4A variables whose name doesn't start ether with a minus or plus sign are not visible from the web client
ca: Les variables d'S4A amb noms que no comencin amb els signes més o menys no són visibles des del client web

source: S4A is free software distributed under an MIT license.
ca: S4A és programari lliure subjecte a una llicència MIT.

source: Technical details
ca: Especificacions tècniques

source: Joan is a biologist who, in his early years, worked in the field of ecology.
ca: En Joan és un biòleg que, en els seus primers anys, va treballar en el camp de l'ecologia.

source: The Team
ca: L'equip

source: Photoresistor and LED
ca: Fotoresistor i LED

source: Basic Examples
ca: Exemples Bàsics

source: Download and install the Arduino environment by following the instructions on http://arduino.cc/en/Main/Software.
ca: Descarregueu i instal·leu l'entorn Arduino seguint les instruccions de http://arduino.cc/en/Main/Software.

source: Scratch IO Wiki - by José Javier Vitón
ca: Scratch IO Wiki - per José Javier Vitón

source: So yes, it will most probably work on your PC.
ca: Així que, molt probablement, funcionarà al vostre ordinador.

source: http://[IP]:42001/vars-update=[variable-name]=[value]
ca: http://[IP]:42001/vars-update=[nom-de-la-variable]=[valor]

source: Exercices
ca: Exercicis

source: Download our firmware from here
ca: Descarregueu el nostre firmware aquí

source: We have developed a simple Android application that can communicate with S4A through HTTP by means of the remote sensors protocol in Scratch.
ca: Hem desenvolupat una aplicació simple d'Android que pot comunicar-se amb S4A via HTTP mitjançant el protocol de sensors remots d'Scratch.

source: Added a "check for updates" option in "Help" menu, from now on there is no need to visit website to check for new versions
ca: Afegida opció per a comprovar si hi ha actualitzacions disponibles des del menú d'ajuda. Ja no cal visitar la web per a comprovar-ho

source: S4A is backwards compatible with Scratch, so you can open Scratch projects in it.
ca: S4A és compatible amb Scratch, de manera que és possible obrir projectes d'Scratch des de S4A.

source: Her first final thesis consisted in building a framework to work with Arduino boards from within the Pharo Smalltalk environment.
ca: El seu primer projecte final va consistir en desenvolupar un entorn per a treballar amb plaques Arduino des de l'entorn d'Smalltalk Pharo.

source: Load the firmware into your board through Tools > Upload
ca: Carregueu el firmware a la placa mitjançant l'opció de menú Tools > Upload

source: About S4A
ca: Què és S4A

source: RGB LED
ca: LED RGB

source: from the Web
ca: des del Web

source: S4A Protocol Specs
ca: Especificació del protocol S4A

source: HTTP API
ca: API HTTP

source: Other boards haven't been tested, but they may also work.
ca: No s'ha provat amb altres plaques, però és possible que també funcionin.

source: Our main purpose was to provide an easy way to interact with the real world by taking advantage of the ease of use of Scratch.
ca: La nostra motivació principal va ser proporcionar una manera senzilla per a interactuar amb el món real, aprofitant-nos de la facilitat d'ús d'Scratch.

source: Installing S4A requires you to install software both in your PC and your Arduino board.
ca: Per a instal·lar S4A, cal instal·lar software tan al PC com a la placa Arduino.

source: Fixed bug in Windows version, in which title bar didn't show the name and version of S4A when launched
ca: Arreglat bug de la versió per a Windows, en què la barra de títol no mostrava el nom i la versió d'S4A

source: Changelog
ca: Canvis

source: You will need to load the new firmware, besides updating the bootloader in some boards
ca: És imprescindible carregar el nou firmware, així com actualitzar el bootloader en determinades plaques

source: You can subscribe by sending an email to:
ca: Per a subscriure-us-hi, envieu un correu a:

source: Documentation and Examples
ca: Documentació i exemples

source: An LED that switches state when we push a button.
ca: Un LED que canvia d'estat quan polsem un botó.

source: Using an RGB LED from Scratch.
ca: Com utilitzar un LED RGB des d'Scratch.

source: index_ca.html
ca: index.html

source: It provides new blocks for managing sensors and actuators connected to Arduino.
ca: Proporciona blocs nous per tractar amb sensors i actuadors connectats a una placa Arduino.

source: S4A is a Scratch modification that allows for simple programming of the Arduino open source hardware platform.
ca: S4A és una modificació d'Scratch que permet programar la plataforma de hardware lliure Arduino d'una manera senzilla.

source: Music: A theremin-like instrument
ca: Música: Un instrument similar a un theremin

source: He currently leads the Technological Education Research team Edutec.
ca: Acualment, és el cap de l'equip de recerca en educació tecnològica Edutec.

source: Later on, she used this project as the basis on which S4A was written.
ca: Més endavant, va utilitzar aquest projecte com a base sobre la qual es va programar S4A.

source: Jordi is an associate professor at the Software Departament of the Technical University of Catalonia (Universitat Politècnica de Catalunya).
ca: En Jordi és professor adjunt al departament de software de la Universitat Politècnica de Catalunya (UPC).

source: Lots of bugfixes
ca: Molts bug arreglats

source: In HiS4A (Android), type the local network IP of the PC where S4A is running (you can find that out thorugh Edit > Show IP address), plus the prefix (only needed if you are connecting from more than one Android client)
ca: A HiS4A (Android), introduïu la IP local del PC on tingueu S4A funcionant (podeu trobar-la des del menú Edita > Host de xarxa), més el prefix (només necessari si us esteu connectant des de més d'un client d'Android)

source: See Android section.
ca: Vegeu la secció d'Android.

source: Contact Us
ca: Contacte

source: Also saved in same file if changed from language menu
ca: També es desa en aquest mateix arxiu en canviar-se des del menú d'idioma

source: Using the example web application:
ca: Ús de l'aplicació web d'exemple:

source: Fixed compatibility with Arduino UNO on Linux (thanks to Jorge Gómez).
ca: Arreglada la compatibilitat amb Arduino UNO a Linux (gràcies a Jorge Gómez).

source: Later on, he joined different projects that aim to establish closer contact between users and programming.
ca: Més endavant, es va unir a diversos projectes amb l'objectiu d'establir una relació més propera entre els usuaris i la programació.

source: Update an S4A variable:
ca: Actualitzar una variable de S4A:

source: In S4A, enable remote sensors (right click on any "Sensors" block)
ca: A S4A, activeu els sensors remots (clic dret a qualsevol bloc de "Sensors")

source: The buttons correspond to messages and the touchpad and slider to remote sensors
ca: Els botons corresponen a missatges, i el touchpad i lliscador a sensors remots

source: Once subscribed, you can reach the list at:
ca: Una vegada us hi hagueu subscrit, podeu enviar els vostres missatges a:

source: S4A variables whose name starts with a plus sign (i.e. +playerName) are visible and modifiable from the web client
ca: Les variables d'S4A amb noms que comencin amb un signe més (ex. +nomJugador) són visibles i modificables des del client web

source: He enrolled to his first programming course in 1975, when computers where still programmed by means of punch cards.
ca: Es va inscriure al seu primer curs de programació l'any 1975, quan els ordinadors encara es programaven amb targetes perforades.

source: He spends most of his time divulging, spreading the word of and programming in Smalltalk, an amazing programming language that, you know, everyone should be using.
ca: Inverteix la major part del seu temps en divulgar, difondre la idea i programar en Smalltalk, un llenguatge de programació apassionant que considera que tothom hauria d'utilitzar.

source: Full-featured Robot
ca: Robot complet

source: Test web application
ca: Aplicació web de prova

source: He learned Smalltalk at a course given by Jordi Delgado at Citilab in 2008, where he was later hired to build an online programming school.
ca: Va aprendre Smalltalk en un curs impartit per Jordi Delgado al Citilab durant l'any 2008, on més endavant va entrar a treballar amb l'objectiu de desenvolupar una escola virtual de programació.

source: S4A variables whose name starts with a minus sign (i.e. -playerScore) are only visible (not modifiable) from the web client
ca: Les variables S4A amb noms que comencin amb un signe menys (ex. -puntuacioJugador) només són visibles (no modificables) des del client web

source: It uses two arduino boards (remote control + robot), an XBee wireless module, three IR sensors, a camera module and three servomotors.
ca: Consta de dues plaques arduino (per al control remot i el robot), un mòdul wireless XBee, tres sensors d'infrarrojos, un mòdul de càmera i tres servomotors.

source: Download and install the one that fits your configuration:
ca: Descarregueu i instal·leu el que us convingui.

source: Since Scratch is actually a Squeak Smalltalk image, all of its code is actually shipped with the final user version itself.
ca: Com que Scratch és, en realitat, una imatge d'Squeak Smalltalk, tot el seu codi ve inclòs en la versió final.

source: His main work in Citilab has been related to the field of training in two areas: teaching programming with Scratch, especially to children, and teaching computer skills to early adult citizens.
ca: La seva tasca principal al Citilab ha estat relacionada amb el camp de la formació en dues àrees: l'ensenyament de la programació mitjançant Scratch, especialment per a nens, i la formació en coneixements d'informàtica a ciutadans adults.

source: Fixed object collision bug (Arduino and non-Arduino)
ca: Arreglat bug de col·lisió entre objectes (Arduino i no Arduino)

source: External Documentation Links
ca: Ençallos externs de documentació

source: Open the firmware file (S4AFirmware15.ino) from the Arduino environment
ca: Obriu l'arxiu de firmware (S4AFirmware15.ino) des de l'entorn Arduino

source: Frequently Asked Questions
ca: Preguntes més freqüents

source: You can download it here or by scanning the QR code below:
ca: Podeu decarregar-vos-el des d'aquí, o escanejant aquest codi QR:

source: CA ES
ca: EN ES

source: S4A Developer Edition
ca: S4A per a desenvolupadors

source: S4A is free software distributed under an MIT license
ca: S4A és programari lliure subjecte a una llicència MIT.

source: And you can subscribe, contribute and browse the mail list forum at:
ca: També podeu utilitzar la interfície web de la llista de correu per a subscriure-us, contribuir i consultar l'arxiu:

source: Being Smalltalk programmers ourselves, we were able to modify its source code in order to achieve interaction with Arduino boards.
ca: Essent programadors d'Smalltalk, vam poder modificar el seu codi font per aconseguir que interactués amb plaques Arduino.

source: Broadcast a message:
ca: Enviar un missatge:

source: The Arduino sprite will automatically find the usb port where the board is connected.
ca: L'sprite Arduino trobarà automàticament el port USB on s'hagi connectat la placa.

source: Using a PicoBoard along with an Arduino board is also supported.
ca: S4A permet utilitzar una PicoBoard conjuntament amb un Arduino.

source: He belongs to the research group LARCA and teaches at the Barcelona School of Informatics.
ca: Pertany al grup de recerca LARCA i imparteix classes a la Facultat d'Informàtica de Barcelona.

source: Some of the following demos are in Catalan or Spanish, but the images pretty much speak for themselves.
ca: Aquí trobareu un recull de demos en català o castellà.

source: You can find blocks to manage standard and continuous rotation servomotors:
ca: També hi trobareu blocs per a tractar amb motors estàndard i servomotors de rotació contínua.

source: S4A interacts with Arduino by sending the actuator states and receiving sensor states every 75 ms, therefore the pulse width needs to be greater than this time period.
ca: S4A interactua amb Arduino enviant l'estat dels actuadors i rebent l'estat dels sensors cada 75 ms, per tant l'amplada del pols ha de ser major que aquest període.

source: About
ca: Què és

source: If you want to see the HTTP API in action, you can do so from our test webapp:
ca: Per a veure l'API HTTP en funcionament, podeu utilitzar l'aplicació web de prova:

source: However, you won't be able to share your projects on the Scratch community website because doing so goes against the Scratch terms of use.
ca: En qualsevol cas, no és possible compartir projectes de S4A a la web de la comunitat Scratch, ja que això aniria en contra del termes i condicions d'ús d'Scratch.

source: Components have to be connected in a particular way.
ca: Els components s'han de connectar d'una manera determinada.

source: The Android application uses a very simple protocol we developed on top of the Scratch HTTP message protocol, so it is also possible to interact to S4A from a browser or any other network enabled application.
ca: L'aplicació Android utilitza un protocol molt senzill que hem desenvolupat sobre el protocol de missatges HTTP d'Scratch, la qual cosa permet interactuar amb S4A des d'un navegador o qualsevol altra aplicació amb accés a la xarxa.

source: You can manage a board wirelessly by attaching an RF module to it, such as Xbee.
ca: És possible comunicar-se inalàmbricament amb una placa mitjançant un mòdul de RF, com ara Xbee.

source: S4A has been developed at Citilab by the Edutech Research Group, with the help of the Smalltalk.cat programming group and of collaborators like Jorge Gómez, instructor at Training Center Padre Piquer from Madrid.
ca: S4A ha estat desenvolupat al Citilab per l'equip de recerca Edutech, amb l'ajuda del grup de programació Smalltalk.cat i de col·laboradors com Jorge Gómez, instructor al centre de formació Padre Piquer de Madrid.

source: For Developers
ca: Per a programadors

source: Changed the sensor board names and their corresponding Arduino blocks to show real pin numbers
ca: Canviats els noms del panell de sensors i els seus corresponents blocs d'Arduino per mostrar números de pin reals
